[
  {
    "level": "People Management (1+ year)",
    "items": [
      "Leading the Yahoo! Search Front-End (FE) engineering team (10+ FTEs), while collaborating cross-functionally with teams across Yahoo! — including Yahoo! Homepage and Yahoo! Commerce — to drive native and redirect traffic, increase user engagement, and grow revenue across multiple products. Spearheaded major initiatives such as the Yahoo! Search refresh, APAC homepage redesign, personalized Trending Now (US), and Hippo integration.",
      "Reorganized the engineering team into product-centric squads (B2B/B2C) and platform groups (platform/tech migration), with full ownership of resource planning and execution. Enriching team engagement and productivity by cultivating and shaping software engineering culture.",
      "Motivating talents and coaching individual career development at different levels (IC2 to IC4). ",
      "Lecturer of Yahoo! Taiwan Scrum training for new hires annually; recognized as a Certified Product Owner and Certified Scrum Master (Scrum Inc)."
    ]
  },
  {
    "level": "Individual Contributor (9+ years)",
    "items": [
      "Led the FE integration of Yahoo! Search with Microsoft Bing Search partnership in 2020. Experienced in A/B testing with a strong foundation in metrics analysis, monetization strategies, FE and middleware integration, i18n/l10n, and UX interaction.",
      "Collaborated with Microsoft Bing Ads team (Beijing) and launched Yahoo! Search Product Listing Ads (PLA) in Taiwan and Hong Kong in 2022. Led the engineering integration plan from 0 to 1 by a successful product launch; Involved in an inter-company collaboration with Legal, BD, Product, etc.",
      "Proficient in JavaScript and PHP with deep expertise in building reliable Continuous Integration/Continuous Delivery (CI/CD) release pipelines across web and hybrid app development.",
      "Achieved high-profile hackathon wins in world-class competitions (Yahoo! and Mozilla). Experienced in participating in diverse and creative hackathons (Facebook, Line, Booking.com, and Baidu)."
    ]
  }
]
